# -*- coding: utf-8 -*-

# (цикл while)

# Ежемесячная стипендия студента составляет educational_grant руб., а расходы на проживание превышают стипендию
# и составляют expenses руб. в месяц. Рост цен ежемесячно увеличивает расходы на 3%, кроме первого месяца
# Составьте программу расчета суммы денег, которую необходимо единовременно попросить у родителей,
# чтобы можно было прожить учебный год (10 месяцев), используя только эти деньги и стипендию.
# Формат вывода:
#   Студенту надо попросить ХХХ.ХХ рублей

educational_grant, expenses = 10000, 12000

educational_grant_all = educational_grant * 10
expenses_all = expenses
expenses_prev = expenses
for i in range(1, 10):
    expenses_prev += expenses_prev * 0.1
    expenses_all += expenses_prev

print("Student must ask for ", expenses_all - educational_grant_all, "rub")
